PolderLabsVOF/TimeTone/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_BUTTONMATRIX=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_SPINNER=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HTTPS certificate verification can briefly monopolize the network task on
# ESP32's software ECC path. The API task is pinned away from LVGL and all
# requests have their own timeout; give the idle watchdog enough margin for a
# first TLS handshake without allowing an unbounded stall.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# LVGL failures are silent without the log callback. The malloc assert is
# intentionally disabled: a transient draw-buffer allocation failure must
# return to the render loop instead of entering LV_ASSERT_HANDLER's infinite
# loop. The layer buffer is kept below the remaining pool's largest free block
# so transformed controls (including tile press feedback) have headroom.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_ERROR=y
CONFIG_LV_USE_ASSERT_MALLOC=n
CONFIG_LV_DRAW_LAYER_SIMPLE_BUF_SIZE=16384

# Crash forensics. The crash this firmware shipped with was heap corruption
# from a task-stack overflow, and CONFIG_ESP_COREDUMP_ENABLE_TO_NONE left no
# evidence, so it read as a random reboot. ESP_COREDUMP_ENABLE also selects the
# ELF data format (CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF). The dump is written to
# the "coredump" partition in partitions.csv.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y


# Phase 1 of the TimeTone port. Design type sizes are 11/12/13/14/15px; LVGL
# ships discrete Montserrat sizes, so we add 12 (for the 11/12/13 role) and 16
# (for the 15px role). 14 is already enabled below. Bold is approximated by
# the accent background (LVGL's bundled Montserrat has no bold variant).
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
